mlsorensen/Apollo2/src/device/main.cpp
  // Self-install reached kReady: the new image is written to the spare slot and
  // set to boot. Reboot into it (BLE was already parked for the download; the
  // 60 s health-confirm below arms rollback if it doesn't come up clean).
  if (g_update_check.install_status().state == core::InstallState::kReady) {
    core::logf("UpdateInstall: restarting into the new image\n");
    Serial.flush();
    delay(400);
    esp_restart();
  }

  // First-boot health confirm for an OTA-installed image: the bootloader
  // boots it PENDING_VERIFY (verifyRollbackLater below defers the automatic
  // confirm), and a build that crashes/bootloops before this point is rolled
  // back automatically. Surviving 60 s of normal loop() = healthy.
  {
    static bool ota_checked = false;
    if (!ota_checked && millis() > 60000) {
      ota_checked = true;
      const esp_partition_t* run = esp_ota_get_running_partition();
      esp_ota_img_states_t st;
      if (esp_ota_get_state_partition(run, &st) == ESP_OK &&
          st == ESP_OTA_IMG_PENDING_VERIFY) {
        esp_ota_mark_app_valid_cancel_rollback();
        core::logf("OTA: new image confirmed healthy (rollback canceled)\n");
      }
    }
  }

  // Reflect the latest cached machine state in the UI (cheap; no BLE here).
  // NOTE this path re-sets many Home widgets — everything it touches must go
  // through the ui::set_* change-detecting setters (widgets.h): LVGL setters
  // invalidate even for identical values, and the resulting no-op churn
  // doubled every ~500ms render pass on the S3 (visible scroll stutter).
  static uint32_t last = 0;
  if (millis() - last > kUiRefreshMs) {
    last = millis();
    g_app.refresh();
  }

  // Sample temps into the history ring for the Stats charts (connected only).
  static uint32_t last_sample = 0;
  if (millis() - last_sample > kSampleMs) {
    last_sample = millis();
    const core::MachineSnapshot snap = g_micra.snapshot();
    if (snap.link == core::Link::Connected) {
      g_history.add(snap.brew_temp_c, snap.boiler_temp_c);
    }
  }

  // 1ms (was 5): under load the loop runs exactly once per LVGL frame, so the
  // whole delay lands on every frame's cadence — profiled at ~5ms/frame of
  // pure idle on the 5". 1ms still yields to lower-priority tasks.
  delay(1);
}
